src/main/resources/header2.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<wsse:Timestamp wsu:Id="TS-DB642659222CEA2BF1167555584222359">
				<wsse:Created>2023-02-05T00:10:42Z</wsse:Created>
				<wsse:Expires>2023-02-05T00:15:42Z</wsse:Expires>
			</wsse:Timestamp>
			
			<wsse:UsernameToken wsu:Id="UsernameToken-DB642659222CEA2BF1167555584222358">
				<wsse:Username>PvPlanner_VigorSolar</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">m+J32ybDSo4sZPNEn7w1psl3lIQ=</wsse:Password>
				<wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">5DiiRzBDeIh/dd8tDvZgDQ==</wsse:Nonce>
				<wsse:Created>2023-02-05T00:10:42.223Z</wsse:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</SOAP-ENV:Header>
	
	<S:Body><ns3:calculateRequest xmlns="http://geomodel.eu/schema/common/pv" xmlns:ns2="http://geomodel.eu/schema/common/geo" xmlns:ns3="http://geomodel.eu/schema/ws/pvplanner"><ns3:site lat="48.61259" lng="20.827079"><ns2:terrain azimuth="175" elevation="45"/><system availability="99.0" installationType="ROOF_MOUNTED" installedPower="1.0"><module type="CSI"/><inverter><efficiency xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" percent="97.5" xsi:type="EfficiencyConstant"/></inverter></system></ns3:site></ns3:calculateRequest></S:Body></S:Envelope>
